{
    "id": "65",
    "nameArabic": "الطلاق",
    "name": "At-Talaq",
    "value": "065",
    "jumlahAyat": 12,
    "ayah": [
        {
            "number": "1",
            "text": "يٰٓاَيُّهَا النَّبِيُّ اِذَا طَلَّقْتُمُ النِّسَاۤءَ فَطَلِّقُوْهُنَّ لِعِدَّتِهِنَّ وَاَحْصُوا الْعِدَّةَۚ وَاتَّقُوا اللّٰهَ رَبَّكُمْۚ  لَا تُخْرِجُوْهُنَّ مِنْۢ بُيُوْتِهِنَّ وَلَا يَخْرُجْنَ اِلَّآ اَنْ يَّأْتِيْنَ بِفَاحِشَةٍ مُّبَيِّنَةٍۗ وَتِلْكَ حُدُوْدُ اللّٰهِ ۗوَمَنْ يَّتَعَدَّ حُدُوْدَ اللّٰهِ فَقَدْ ظَلَمَ نَفْسَهٗ ۗ لَا تَدْرِيْ لَعَلَّ اللّٰهَ يُحْدِثُ بَعْدَ ذٰلِكَ اَمْرًا",
            "teksLatin": "yā ayyuhan-nabiyyu iżā ṭallaqtumun-nisā'a fa ṭalliqūhunna li‘iddatihinna wa aḥṣul-‘iddah(ta), wattaqullāha rabbakum, lā tukhrijūhunna mim buyūtihinna wa lā yakhrujna illā ay ya'tīna bifāḥisyatim mubayyinah(tin), wa tilka ḥudūdullāh(i), wa may yata‘adda ḥudūdallāhi faqad ẓalama nafsah(ū), lā tadrī la‘allallāha yuḥdiṡu ba‘da żālika amrā(n).",
            "teksIndonesia": "Wahai Nabi! Apabila kamu menceraikan istri-istrimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) idahnya (yang wajar), dan hitunglah waktu idah itu, serta bertakwalah kepada Allah Tuhanmu. Janganlah kamu keluarkan mereka dari rumahnya dan janganlah (diizinkan) keluar kecuali jika mereka mengerjakan perbuatan keji yang jelas. Itulah hukum-hukum Allah, dan barangsiapa melanggar hukum-hukum Allah, maka sungguh, dia telah berbuat zalim terhadap dirinya sendiri. Kamu tidak mengetahui barangkali setelah itu Allah mengadakan suatu ketentuan yang baru. ",
            "tafsir": "Dalam ayat ini, khithab (seruan) Allah ditujukan kepada Nabi Muhammad, tetapi pada hakikatnya dimaksudkan juga kepada umatnya yang beriman. Allah menyerukan kepada orang-orang mukmin apabila mereka ingin menceraikan (menalak) istri-istri mereka, agar melakukannya ketika istrinya langsung bisa menjalani idahnya, yaitu pada waktu istri-istri itu suci dari haid dan belum dicampuri, sebagaimana dijelaskan dalam satu hadis Nabi saw yang berasal dari Ibnu 'Umar: \n\n'Abdullah bin 'Umar telah menalak istrinya dalam keadaan haid. Lalu 'Umar bin Khaththab menanyakan hal itu kepada Nabi saw, lalu beliau memerintahkan 'Abdullah bin 'Umar merujuk istrinya, menahan istrinya (tinggal bersama) sampai masa suci. Lalu menunggu masa haidnya lagi sampai suci, maka setelah itu jika ia menginginkan tinggal bersama istrinya (maka lakukanlah), dan jika ia ingin menalak istrinya (maka lakukanlah) sebelum menggaulinya. Demikianlah masa idah yang diperintahkan Allah ketika perempuan ditalak. (Riwayat al-Bukhari dan Muslim)\n\nSeorang suami yang akan menalak istrinya, agar meneliti dan memperhitungkan betul kapan idah istrinya mulai dan kapan berakhir, agar istri langsung bisa menjalani idahnya sehingga tidak menunggu terlalu lama. Suami juga diminta melaksanakan hukum-hukum dan memenuhi hak-hak istri yang harus dipenuhi selama masa idah. Hendaklah suami itu takut kepada Allah dan jangan menyalahi apa yang telah diperintahkan-Nya mengenai talak, yaitu menjatuhkan talak pada masa yang direstui-Nya dan memenuhi hak istri yang di talak. Antara lain, janganlah sang suami mengeluarkan istri yang ditalaknya dari rumah yang ditempatinya sebelum ditalak dengan alasan marah dan sebagainya, karena menempatkan istri itu pada tempat yang layak adalah hak istri yang telah diwajibkan Allah selama ia masih dalam idah. \n\nSang suami juga dilarang untuk mengeluarkan istri yang sedang menjalani idah dari rumah yang ditempatinya. Apalagi membiarkan keluar sekehendaknya, karena yang demikian merupakan pelanggaran agama, kecuali apabila istri terang-terangan mengerjakan perbuatan keji, seperti melakukan perbuatan zina dan sebagainya. Jika sang istri berkelakuan tidak sopan terhadap mertua, maka bolehlah ia dikeluarkan dari tempat tinggalnya. Demikianlah batas-batas dan ketentuan-ketentuan yang telah digariskan Allah mengenai talak, idah, dan sebagainya.\n\nOleh karena itu, barang siapa melanggar hukum-hukum Allah itu, berarti ia berbuat zalim kepada dirinya sendiri. Andaikata Allah menakdirkan satu perubahan, lalu hati suami berbalik menjadi cinta lagi kepada istrinya yang telah ditalaknya dan merasa menyesal atas perbuatannya kemudian ia ingin rujuk kembali, maka baginya sudah tertutup jalan, bila keinginannya itu dilaksanakan sesudah habis masa idahnya karena ia telah menyia-nyiakan kesempatan yang diberikan kepadanya. Istri yang dimaksud di sini ialah istri yang sudah atau masih haid dan sudah dicampuri sesudah akad nikah. Ada pun istri yang masih kecil atau sudah ayisah (tidak haid lagi) atau belum dicampuri sesudah akad nikah, apabila ditalak, mempunyai hukum idah tersendiri. Berbeda dengan hukum yang berlaku seperti tersebut di atas.",
            "tajweed": [
                {
                    "end": 43,
                    "rule": "madd_munfasil",
                    "start": 41
                },
                {
                    "end": 53,
                    "rule": "hamzat_wasl",
                    "start": 52
                },
                {
                    "end": 54,
                    "rule": "lam_shamsiyyah",
                    "start": 53
                },
                {
                    "end": 57,
                    "rule": "ghunnah",
                    "start": 54
                },
                {
                    "end": 76,
                    "rule": "qalqalah",
                    "start": 74
                },
                {
                    "end": 82,
                    "rule": "hamzat_wasl",
                    "start": 81
                },
                {
                    "end": 83,
                    "rule": "lam_shamsiyyah",
                    "start": 82
                },
                {
                    "end": 86,
                    "rule": "ghunnah",
                    "start": 83
                },
                {
                    "end": 90,
                    "rule": "madd_muttasil",
                    "start": 88
                },
                {
                    "end": 108,
                    "rule": "ghunnah",
                    "start": 105
                },
                {
                    "end": 123,
                    "rule": "ghunnah",
                    "start": 120
                },
                {
                    "end": 135,
                    "rule": "silent",
                    "start": 133
                },
                {
                    "end": 137,
                    "rule": "hamzat_wasl",
                    "start": 136
                },
                {
                    "end": 150,
                    "rule": "hamzat_wasl",
                    "start": 149
                },
                {
                    "end": 158,
                    "rule": "silent",
                    "start": 156
                },
                {
                    "end": 160,
                    "rule": "hamzat_wasl",
                    "start": 159
                },
                {
                    "end": 195,
                    "rule": "ghunnah",
                    "start": 192
                },
                {
                    "end": 202,
                    "rule": "iqlab",
                    "start": 199
                },
                {
                    "end": 213,
                    "rule": "ghunnah",
                    "start": 210
                },
                {
                    "end": 228,
                    "rule": "qalqalah",
                    "start": 226
                },
                {
                    "end": 238,
                    "rule": "madd_munfasil",
                    "start": 236
                },
                {
                    "end": 245,
                    "rule": "idghaam_ghunnah",
                    "start": 241
                },
                {
                    "end": 258,
                    "rule": "madd_2",
                    "start": 257
                },
                {
                    "end": 268,
                    "rule": "idghaam_ghunnah",
                    "start": 263
                },
                {
                    "end": 280,
                    "rule": "idghaam_ghunnah",
                    "start": 276
                },
                {
                    "end": 296,
                    "rule": "hamzat_wasl",
                    "start": 295
                },
                {
                    "end": 311,
                    "rule": "idghaam_ghunnah",
                    "start": 307
                },
                {
                    "end": 328,
                    "rule": "hamzat_wasl",
                    "start": 327
                },
                {
                    "end": 341,
                    "rule": "qalqalah",
                    "start": 339
                },
                {
                    "end": 358,
                    "rule": "madd_2",
                    "start": 357
                },
                {
                    "end": 367,
                    "rule": "qalqalah",
                    "start": 365
                },
                {
                    "end": 380,
                    "rule": "hamzat_wasl",
                    "start": 379
                },
                {
                    "end": 406,
                    "rule": "madd_2",
                    "start": 405
                }
            ]
        },
        {
            "number": "2",
            "text": "فَاِذَا بَلَغْنَ اَجَلَهُنَّ فَاَمْسِكُوْهُنَّ بِمَعْرُوْفٍ اَوْ فَارِقُوْهُنَّ بِمَعْرُوْفٍ وَّاَشْهِدُوْا ذَوَيْ عَدْلٍ مِّنْكُمْ وَاَقِيْمُوا الشَّهَادَةَ لِلّٰهِ ۗذٰلِكُمْ يُوْعَظُ بِهٖ مَنْ كَانَ يُؤْمِنُ بِاللّٰهِ وَالْيَوْمِ الْاٰخِرِ ەۗ وَمَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مَخْرَجًا ۙ",
            "teksLatin": "fa iżā balagna ajalahunna fa amsikūhunna bima‘rūfin au fāriqūhunna bima‘rūfiw wa asyhidū żawai ‘adlim minkum wa aqīmusy-syahādata lillāh(i), żālikum yū‘aẓu bihī man kāna yu'minu billāhi wal-yaumil-ākhir(i), wa may yattaqillāha yaj‘al lahū makhrajā(n).",
            "teksIndonesia": "Maka apabila mereka telah mendekati akhir idahnya, maka rujuklah (kembali kepada) mereka dengan baik atau lepaskanlah mereka dengan baik dan persaksikanlah dengan dua orang saksi yang adil di antara kamu dan hendaklah kamu tegakkan kesaksian itu karena Allah. Demikianlah pengajaran itu diberikan bagi orang yang beriman kepada Allah dan hari akhirat. Barangsiapa bertakwa kepada Allah niscaya Dia akan membukakan jalan keluar baginya, ",
            "tafsir": "Dalam ayat-ayat ini, Allah menerangkan bahwa apabila masa idah istri hampir habis dan suami masih ingin berkumpul kembali, ia boleh rujuk kepada istrinya dan tinggal bersama secara baik sebagai suami-istri, melaksanakan kewajibannya, memberi belanja, pakaian, tempat tinggal, dan lainnya. Akan tetapi, kalau suami tetap tidak akan rujuk kepada istri, maka ia boleh melepaskannya secara baik pula tanpa ada ketegangan terjadi, menyempurnakan maharnya, memberi mut'ah sebagai imbalan dan terima kasih atas kebaikan istrinya selama ia hidup bersama dan lain-lain yang menghibur hatinya. Apabila suami memilih rujuk, maka hendaknya hal itu disaksikan oleh dua orang saksi laki-laki yang adil, untuk memantapkan rumah tangganya kembali.\n\nSelanjutnya Allah menyerukan agar kesaksian itu diberikan secara jujur karena Allah semata-mata tanpa mengharapkan bayaran dan tanpa memihak, sebagaimana firman Allah:\n\nJadilah kamu penegak keadilan, menjadi saksi karena Allah, walaupun terhadap dirimu sendiri. (an-Nisa'/4: 135)\n\nDemikian seruan mengenai rujuk dan talak untuk menjadi pelajaran bagi orang yang beriman kepada Allah di hari akhirat. Orang yang bertakwa kepada Allah, dan patuh menaati peraturan-peraturan yang telah ditetapkan-Nya, antara lain mengenai rujuk dan talak tersebut di atas, niscaya Ia akan menunjukkan baginya jalan keluar dari kesulitan yang dihadapinya.\n\nBagi orang-orang yang bertakwa kepada Allah, tidak saja diberi dan dimudahkan jalan keluar dari kesulitan yang dihadapinya, tetapi juga diberi rezeki oleh Allah dari arah yang tidak disangka-sangka, yang belum pernah terlintas dalam pikirannya. Selanjutnya Allah menyerukan agar mereka bertawakal kepada-Nya, karena Allah-lah yang mencukupkan keperluannya mensukseskan urusannya. \n\nBertawakal kepada Allah artinya berserah diri kepada-Nya, menyerahkan sepenuhnya kepada-Nya keberhasilan usaha. Setelah ia berusaha dan memantapkan satu ikhtiar, barulah ia bertawakal. Bukanlah tawakal namanya apabila seorang menyerahkan keadaannya kepada Allah tanpa usaha dan ikhtiar. Berusaha dan berikhtiar dahulu baru bertawakal menyerahkan diri kepada Allah. \n\nPernah terjadi seorang Arab Badui berkunjung kepada Nabi di Medinah dengan mengendarai unta. Setelah orang Arab itu sampai ke tempat yang dituju, ia turun dari untanya lalu masuk menemui Nabi saw. Nabi bertanya, \"Apakah unta sudah ditambatkan?\" Orang Badui itu menjawab, \"Tidak! Saya melepaskan begitu saja, dan saya bertawakal kepada Allah.\" Nabi saw bersabda, \"Tambatkan dulu untamu, baru bertawakal.\"\n\nAllah akan melaksanakan dan menyempurnakan urusan orang yang bertawakal kepada-Nya sesuai dengan kodrat iradat-Nya, pada waktu yang telah ditetapkan, sebagaimana dijelaskan dalam firman-Nya:\n\nDan segala sesuatu ada ukuran di sisi-Nya. (ar-Ra'd/13: 8)",
            "tajweed": [
                {
                    "end": 28,
                    "rule": "ghunnah",
                    "start": 25
                },
                {
                    "end": 45,
                    "rule": "ghunnah",
                    "start": 42
                },
                {
                    "end": 76,
                    "rule": "ghunnah",
                    "start": 73
                },
                {
                    "end": 91,
                    "rule": "idghaam_ghunnah",
                    "start": 87
                },
                {
                    "end": 102,
                    "rule": "silent",
                    "start": 100
                },
                {
                    "end": 114,
                    "rule": "qalqalah",
                    "start": 112
                },
                {
                    "end": 120,
                    "rule": "idghaam_ghunnah",
                    "start": 115
                },
                {
                    "end": 123,
                    "rule": "ikhfa",
                    "start": 120
                },
                {
                    "end": 138,
                    "rule": "silent",
                    "start": 136
                },
                {
                    "end": 140,
                    "rule": "hamzat_wasl",
                    "start": 139
                },
                {
                    "end": 141,
                    "rule": "lam_shamsiyyah",
                    "start": 140
                },
                {
                    "end": 147,
                    "rule": "madd_2",
                    "start": 146
                },
                {
                    "end": 163,
                    "rule": "madd_2",
                    "start": 162
                },
                {
                    "end": 183,
                    "rule": "madd_2",
                    "start": 182
                },
                {
                    "end": 190,
                    "rule": "ikhfa",
                    "start": 186
                },
                {
                    "end": 206,
                    "rule": "hamzat_wasl",
                    "start": 205
                },
                {
                    "end": 216,
                    "rule": "hamzat_wasl",
                    "start": 215
                },
                {
                    "end": 226,
                    "rule": "hamzat_wasl",
                    "start": 225
                },
                {
                    "end": 244,
                    "rule": "idghaam_ghunnah",
                    "start": 240
                },
                {
                    "end": 251,
                    "rule": "hamzat_wasl",
                    "start": 250
                },
                {
                    "end": 262,
                    "rule": "qalqalah",
                    "start": 260
                },
                {
                    "end": 272,
                    "rule": "madd_2",
                    "start": 271
                }
            ]
        },
        {
            "number": "3",
            "text": "وَّيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُۗ وَمَنْ يَّتَوَكَّلْ عَلَى اللّٰهِ فَهُوَ حَسْبُهٗ ۗاِنَّ اللّٰهَ بَالِغُ اَمْرِهٖۗ قَدْ جَعَلَ اللّٰهُ لِكُلِّ شَيْءٍ قَدْرًا ",
            "teksLatin": "wa yarzuqhu min ḥaiṡu lā yaḥtasib(u), wa may yatawakkal ‘alallāhi fa huwa ḥasbuh(ū), innallāha bāligu amrih(ī), qad ja‘alallāhu likulli syai'in qadrā(n).",
            "teksIndonesia": "dan Dia memberinya rezeki dari arah yang tidak disangka-sangkanya. Dan barangsiapa bertawakal kepada Allah, niscaya Allah akan mencukupkan (keperluan)nya. Sesungguhnya Allah melaksanakan urusan-Nya. Sungguh, Allah telah mengadakan ketentuan bagi setiap sesuatu. ",
            "tafsir": "Dalam ayat-ayat ini, Allah menerangkan bahwa apabila masa idah istri hampir habis dan suami masih ingin berkumpul kembali, ia boleh rujuk kepada istrinya dan tinggal bersama secara baik sebagai suami-istri, melaksanakan kewajibannya, memberi belanja, pakaian, tempat tinggal, dan lainnya. Akan tetapi, kalau suami tetap tidak akan rujuk kepada istri, maka ia boleh melepaskannya secara baik pula tanpa ada ketegangan terjadi, menyempurnakan maharnya, memberi mut'ah sebagai imbalan dan terima kasih atas kebaikan istrinya selama ia hidup bersama dan lain-lain yang menghibur hatinya. Apabila suami memilih rujuk, maka hendaknya hal itu disaksikan oleh dua orang saksi laki-laki yang adil, untuk memantapkan rumah tangganya kembali.\n\nSelanjutnya Allah menyerukan agar kesaksian itu diberikan secara jujur karena Allah semata-mata tanpa mengharapkan bayaran dan tanpa memihak, sebagaimana firman Allah:\n\nJadilah kamu penegak keadilan, menjadi saksi karena Allah, walaupun terhadap dirimu sendiri. (an-Nisa'/4: 135)\n\nDemikian seruan mengenai rujuk dan talak untuk menjadi pelajaran bagi orang yang beriman kepada Allah di hari akhirat. Orang yang bertakwa kepada Allah, dan patuh menaati peraturan-peraturan yang telah ditetapkan-Nya, antara lain mengenai rujuk dan talak tersebut di atas, niscaya Ia akan menunjukkan baginya jalan keluar dari kesulitan yang dihadapinya.\n\nBagi orang-orang yang bertakwa kepada Allah, tidak saja diberi dan dimudahkan jalan keluar dari kesulitan yang dihadapinya, tetapi juga diberi rezeki oleh Allah dari arah yang tidak disangka-sangka, yang belum pernah terlintas dalam pikirannya. Selanjutnya Allah menyerukan agar mereka bertawakal kepada-Nya, karena Allah-lah yang mencukupkan keperluannya mensukseskan urusannya. \n\nBertawakal kepada Allah artinya berserah diri kepada-Nya, menyerahkan sepenuhnya kepada-Nya keberhasilan usaha. Setelah ia berusaha dan memantapkan satu ikhtiar, barulah ia bertawakal. Bukanlah tawakal namanya apabila seorang menyerahkan keadaannya kepada Allah tanpa usaha dan ikhtiar. Berusaha dan berikhtiar dahulu baru bertawakal menyerahkan diri kepada Allah. \n\nPernah terjadi seorang Arab Badui berkunjung kepada Nabi di Medinah dengan mengendarai unta. Setelah orang Arab itu sampai ke tempat yang dituju, ia turun dari untanya lalu masuk menemui Nabi saw. Nabi bertanya, \"Apakah unta sudah ditambatkan?\" Orang Badui itu menjawab, \"Tidak! Saya melepaskan begitu saja, dan saya bertawakal kepada Allah.\" Nabi saw bersabda, \"Tambatkan dulu untamu, baru bertawakal.\"\n\nAllah akan melaksanakan dan menyempurnakan urusan orang yang bertawakal kepada-Nya sesuai dengan kodrat iradat-Nya, pada waktu yang telah ditetapkan, sebagaimana dijelaskan dalam firman-Nya:\n\nDan segala sesuatu ada ukuran di sisi-Nya. (ar-Ra'd/13: 8)",
            "tajweed": [
                {
                    "end": 10,
                    "rule": "qalqalah",
                    "start": 8
                },
                {
                    "end": 48,
                    "rule": "idghaam_ghunnah",
                    "start": 44
                },
                {
                    "end": 65,
                    "rule": "hamzat_wasl",
                    "start": 64
                },
                {
                    "end": 89,
                    "rule": "madd_munfasil",
                    "start": 87
                },
                {
                    "end": 95,
                    "rule": "ghunnah",
                    "start": 92
                },
                {
                    "end": 97,
                    "rule": "hamzat_wasl",
                    "start": 96
                },
                {
                    "end": 107,
                    "rule": "madd_2",
                    "start": 106
                },
                {
                    "end": 121,
                    "rule": "madd_2",
                    "start": 120
                },
                {
                    "end": 126,
                    "rule": "qalqalah",
                    "start": 124
                },
                {
                    "end": 135,
                    "rule": "hamzat_wasl",
                    "start": 134
                },
                {
                    "end": 159,
                    "rule": "ikhfa",
                    "start": 155
                },
                {
                    "end": 161,
                    "rule": "qalqalah",
                    "start": 159
                }
            ]
        },
        {
            "number": "4",
            "text": "وَالّٰۤـِٔيْ يَىِٕسْنَ مِنَ الْمَحِيْضِ مِنْ نِّسَاۤىِٕكُمْ اِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلٰثَةُ اَشْهُرٍۙ وَّالّٰۤـِٔيْ لَمْ يَحِضْنَۗ وَاُولٰتُ الْاَحْمَالِ اَجَلُهُنَّ اَنْ يَّضَعْنَ حَمْلَهُنَّۗ وَمَنْ يَّتَّقِ اللّٰهَ يَجْعَلْ لَّهٗ مِنْ اَمْرِهٖ يُسْرًا ",
            "teksLatin": "wal-lā'ī ya'isna minal-maḥīḍi min nisā'ikum inirtabtum fa ‘iddatuhunna ṡalāṡatu asyhur(in), wal-lā'ī lam yaḥiḍn(a), wa ulātul-aḥmāli ajaluhunna ay yaḍa‘na ḥamlahunn(a), wa may yattaqillāha yaj‘al lahū min amrihī yusrā(n).",
            "teksIndonesia": "Perempuan-perempuan yang tidak haid lagi (menopause) di antara istri-istrimu jika kamu ragu-ragu (tentang masa idahnya) maka idahnya adalah tiga bulan; dan begitu (pula) perempuan-perempuan yang tidak haid. Sedangkan perempuan-perempuan yang hamil, waktu idah mereka itu ialah sampai mereka melahirkan kandungannya. Dan barangsiapa bertakwa kepada Allah, niscaya Dia menjadikan kemudahan baginya dalam urusannya. ",
            "tafsir": "Ayat ini menjelaskan bahwa idah perempuan-perempuan yang ya'is (tidak haid lagi), adalah tiga bulan. Begitu juga perempuan muda yang belum pernah haid. Adapun bagi perempuan-perempuan yang hamil, maka idahnya sampai melahirkan kandungannya. Begitu juga perempuan-perempuan hamil yang meninggal suaminya, idahnya sampai melahirkan kandungannya, sebagaimana yang diriwayatkan Imam Malik, Imam Syafi'i, Abdur Razaq, Ibnu Abi Syaibah, dan Ibnu Mundhir dari Ibnu 'Umar. Ketika ditanya tentang perempuan hamil yang meninggal suaminya, Ibnu 'Umar menjawab, \"Apabila perempuan itu melahirkan kandungannya, maka ia menjadi halal (untuk dinikahi).\" Mengenai hal ini ada ulama yang berpendapat yang didasarkan pada masa terlama dari dua waktu, yaitu kalau hamil tua dan segera melahirkan maka idahnya 4 bulan 10 hari. Sedang kalau hamil muda, idahnya sampai perempuan itu melahirkan. Orang yang bertakwa kepada Allah, melaksanakan perintah-Nya dan menjauhi larangan-Nya, maka ia akan dimudahkan urusannya, dilepaskan dari kesulitan yang dialaminya.\n\nDua ayat di atas (ayat 1 dan 4), dan 2 (dua) ayat lain yang berada di antaranya (ayat 2 dan 3), mengatur mengenai tata cara perceraian. Di antaranya hal yang mengatur masa idah. Masa tersebut dengan jelas disebutkan sebagai 3 (tiga) bulan bagi wanita yang (sedang) tidak haid dan mereka yang sudah memasuki masa menopause, dan sampai saat melahirkan bagi mereka yang sedang mengandung.\n\nPada dasarnya, waktu tiga bulan, apabila tidak lagi terjadi persetubuhan, maka akan dapat ditentukan kondisi wanita, apakah dalam keadaan hamil atau tidak. Karena mulai pada bulan pertama kehamilan, haid akan berhenti. Tentunya, berhentinya haid ini dapat disebabkan oleh banyak hal. Dapat karena hamil, atau sedang memulai proses menopause, atau karena adanya penyakit. Bagi seorang wanita, mereka akan mengetahui terjadinya kehamilan dari adanya beberapa ciri lain, karena kehamilan tidak saja ditandai oleh terlambatnya haid atau makin \"gendutnya\" perut. Masih ada tanda-tanda lainnya. Memang tidak mudah mengetahui apakah seseorang benar-benar hamil atau tidak.",
            "tajweed": [
                {
                    "end": 3,
                    "rule": "hamzat_wasl",
                    "start": 2
                },
                {
                    "end": 8,
                    "rule": "madd_muttasil",
                    "start": 6
                },
                {
                    "end": 28,
                    "rule": "hamzat_wasl",
                    "start": 27
                },
                {
                    "end": 45,
                    "rule": "idghaam_ghunnah",
                    "start": 40
                },
                {
                    "end": 49,
                    "rule": "madd_muttasil",
                    "start": 47
                },
                {
                    "end": 62,
                    "rule": "hamzat_wasl",
                    "start": 61
                },
                {
                    "end": 68,
                    "rule": "qalqalah",
                    "start": 66
                },
                {
                    "end": 87,
                    "rule": "ghunnah",
                    "start": 84
                },
                {
                    "end": 93,
                    "rule": "madd_2",
                    "start": 92
                },
                {
                    "end": 109,
                    "rule": "idghaam_ghunnah",
                    "start": 105
                },
                {
                    "end": 110,
                    "rule": "hamzat_wasl",
                    "start": 109
                },
                {
                    "end": 115,
                    "rule": "madd_muttasil",
                    "start": 113
                },
                {
                    "end": 140,
                    "rule": "silent",
                    "start": 138
                },
                {
                    "end": 143,
                    "rule": "madd_2",
                    "start": 142
                },
                {
                    "end": 147,
                    "rule": "hamzat_wasl",
                    "start": 146
                },
                {
                    "end": 170,
                    "rule": "ghunnah",
                    "start": 167
                },
                {
                    "end": 177,
                    "rule": "idghaam_ghunnah",
                    "start": 173
                },
                {
                    "end": 195,
                    "rule": "ghunnah",
                    "start": 192
                },
                {
                    "end": 204,
                    "rule": "idghaam_ghunnah",
                    "start": 200
                },
                {
                    "end": 211,
                    "rule": "hamzat_wasl",
                    "start": 210
                },
                {
                    "end": 222,
                    "rule": "qalqalah",
                    "start": 220
                },
                {
                    "end": 232,
                    "rule": "madd_2",
                    "start": 231
                },
                {
                    "end": 247,
                    "rule": "madd_2",
                    "start": 246
                }
            ]
        },
        {
            "number": "5",
            "text": "ذٰلِكَ اَمْرُ اللّٰهِ اَنْزَلَهٗٓ اِلَيْكُمْۗ وَمَنْ يَّتَّقِ اللّٰهَ يُكَفِّرْ عَنْهُ سَيِّاٰتِهٖ وَيُعْظِمْ لَهٗٓ اَجْرًا ",
            "teksLatin": "Żālika amrullāhi anzalahū ilaikum, wa may yattaqillāha yukaffir ‘anhu sayyi'ātihī wa yu‘ẓim lahū ajrā(n).",
            "teksIndonesia": "Itulah perintah Allah yang diturunkan-Nya kepada kamu; barangsiapa bertakwa kepada Allah, niscaya Allah akan menghapus kesalahan-kesalahannya dan akan melipatgandakan pahala baginya. ",
            "tafsir": "Dalam ayat ini, Allah menjelaskan bahwa hukum-hukum yang telah disyariatkan mengenai talak, tempat tinggal, dan idah perempuan yang tertera pada ayat-ayat yang lalu adalah ketentuan Allah yang mesti diamalkan dan dilaksanakan.\n\nPada akhir ayat ini, sekali lagi Allah menjelaskan bahwa bagi orang yang bertakwa kepada-Nya dengan mengerjakan perintah-Nya dan menjauhi larangan-Nya, niscaya Dia akan menghapus dan mengampuni dosanya sebagaimana yang telah dijanjikan-Nya. Dalam ayat lain Allah berfirman:\n\nPerbuatan-perbuatan baik itu menghapus kesalahan-kesalahan. (Hud/11: 114)\n\nSelain dari itu, Allah juga melipatgandakan pahala amal mereka, sebagaimana yang Ia janjikan dalam firman-Nya:\n\nBarang siapa berbuat kebaikan mendapat balasan sepuluh kali lipat amalnya. Dan barang siapa berbuat kejahatan dibalas seimbang dengan kejahatannya. Mereka sedikit pun tidak dirugikan (dizalimi). (al-An'am/6: 160)",
            "tajweed": [
                {
                    "end": 3,
                    "rule": "madd_2",
                    "start": 2
                },
                {
                    "end": 16,
                    "rule": "hamzat_wasl",
                    "start": 15
                },
                {
                    "end": 28,
                    "rule": "ikhfa",
                    "start": 25
                },
                {
                    "end": 34,
                    "rule": "madd_munfasil",
                    "start": 32
                },
                {
                    "end": 54,
                    "rule": "idghaam_ghunnah",
                    "start": 50
                },
                {
                    "end": 61,
                    "rule": "hamzat_wasl",
                    "start": 60
                },
                {
                    "end": 99,
                    "rule": "madd_2",
                    "start": 98
                },
                {
                    "end": 117,
                    "rule": "madd_munfasil",
                    "start": 115
                },
                {
                    "end": 122,
                    "rule": "qalqalah",
                    "start": 120
                }
            ]
        },
        {
            "number": "6",
            "text": "اَسْكِنُوْهُنَّ مِنْ حَيْثُ سَكَنْتُمْ مِّنْ وُّجْدِكُمْ وَلَا تُضَاۤرُّوْهُنَّ لِتُضَيِّقُوْا عَلَيْهِنَّۗ وَاِنْ كُنَّ اُولٰتِ حَمْلٍ فَاَنْفِقُوْا عَلَيْهِنَّ حَتّٰى يَضَعْنَ حَمْلَهُنَّۚ فَاِنْ اَرْضَعْنَ لَكُمْ فَاٰتُوْهُنَّ اُجُوْرَهُنَّۚ وَأْتَمِرُوْا بَيْنَكُمْ بِمَعْرُوْفٍۚ وَاِنْ تَعَاسَرْتُمْ فَسَتُرْضِعُ لَهٗٓ اُخْرٰىۗ ",
            "teksLatin": "askinūhunna min ḥaiṡu sakantum miw wujdikum wa lā tuḍārrūhunna lituḍayyiqū ‘alaihinn(a), wa in kunna ulāti ḥamlin fa anfiqū ‘alaihinna ḥattā yaḍa‘na ḥamlahunn(a), fa in arḍa‘na lakum fa ātūhunna ujūrahunn(a), wa'tamirū bainakum bima‘rūf(in), wa in ta‘āsartum fasaturḍi‘u lahū ukhrā.",
            "teksIndonesia": "Tempatkanlah mereka (para istri) di mana kamu bertempat tinggal menurut kemampuanmu dan janganlah kamu menyusahkan mereka untuk menyempitkan (hati) mereka. Dan jika mereka (istri-istri yang sudah ditalak) itu sedang hamil, maka berikanlah kepada mereka nafkahnya sampai mereka melahirkan, kemudian jika mereka menyusukan (anak-anak)mu maka berikanlah imbalannya kepada mereka; dan musyawarahkanlah di antara kamu (segala sesuatu) dengan baik; dan jika kamu menemui kesulitan, maka perempuan lain boleh menyusukan (anak itu) untuknya. ",
            "tafsir": "Dalam ayat ini, Allah menjelaskan bahwa menjadi kewajiban bagi suami memberi tempat tinggal yang layak, sesuai dengan kemampuannya kepada istri yang tengah menjalani idah. Jangan sekali-kali ia berbuat yang menyempitkan dan menyusahkan hati sang istri dengan menempatkannya pada tempat yang tidak layak atau membiarkan orang lain tinggal bersamanya, sehingga ia merasa harus meninggalkan tempat itu dan menuntut tempat lain yang disenangi.\n\nJika istri yang di talak ba'in sedang hamil, maka ia wajib diberi nafkah secukupnya sampai melahirkan. Apabila ia melahirkan, maka habislah masa idahnya. Namun demikian, karena ia menyusukan anak-anak dari suami yang menceraikannya, maka ia wajib diberi nafkah oleh sang suami sebesar yang umum berlaku. Sebaiknya seorang ayah dan ibu merundingkan dengan cara yang baik tentang kemaslahatan anak-anaknya, baik mengenai kesehatan, pendidikan, maupun hal lainnya. Di sejumlah negara muslim, hak-hak perempuan yang dicerai telah diatur secara khusus dalam undang-undang.\n\nApabila di antara kedua belah pihak tidak terdapat kata sepakat, maka pihak ayah boleh saja memilih perempuan lain yang dapat menerima dan memahami kemampuannya untuk menyusukan anak-anaknya. Sekalipun demikian, kalau anak itu tidak mau menyusu kepada perempuan lain, tetapi hanya ke ibunya, maka sang bapak wajib memberi nafkah yang sama besarnya seperti nafkah yang diberikan kepada orang lain.",
            "tajweed": [
                {
                    "end": 14,
                    "rule": "ghunnah",
                    "start": 11
                },
                {
                    "end": 34,
                    "rule": "ikhfa",
                    "start": 31
                },
                {
                    "end": 39,
                    "rule": "idghaam_shafawi",
                    "start": 34
                },
                {
                    "end": 43,
                    "rule": "idghaam_ghunnah",
                    "start": 39
                },
                {
                    "end": 45,
                    "rule": "qalqalah",
                    "start": 43
                },
                {
                    "end": 64,
                    "rule": "madd_6",
                    "start": 62
                },
                {
                    "end": 73,
                    "rule": "ghunnah",
                    "start": 70
                },
                {
                    "end": 88,
                    "rule": "silent",
                    "start": 86
                },
                {
                    "end": 100,
                    "rule": "ghunnah",
                    "start": 97
                },
                {
                    "end": 109,
                    "rule": "ikhfa",
                    "start": 105
                },
                {
                    "end": 112,
                    "rule": "ghunnah",
                    "start": 109
                },
                {
                    "end": 117,
                    "rule": "silent",
                    "start": 115
                },
                {
                    "end": 120,
                    "rule": "madd_2",
                    "start": 119
                },
                {
                    "end": 132,
                    "rule": "ikhfa",
                    "start": 128
                },
                {
                    "end": 137,
                    "rule": "ikhfa",
                    "start": 134
                },
                {
                    "end": 142,
                    "rule": "silent",
                    "start": 140
                },
                {
                    "end": 154,
                    "rule": "ghunnah",
                    "start": 151
                },
                {
                    "end": 183,
                    "rule": "ghunnah",
                    "start": 180
                },
                {
                    "end": 223,
                    "rule": "ghunnah",
                    "start": 220
                },
                {
                    "end": 236,
                    "rule": "ghunnah",
                    "start": 233
                },
                {
                    "end": 250,
                    "rule": "silent",
                    "start": 248
                },
                {
                    "end": 263,
                    "rule": "ikhfa_shafawi",
                    "start": 259
                },
                {
                    "end": 275,
                    "rule": "idghaam_ghunnah",
                    "start": 271
                },
                {
                    "end": 281,
                    "rule": "ikhfa",
                    "start": 277
                },
                {
                    "end": 312,
                    "rule": "madd_munfasil",
                    "start": 310
                }
            ]
        },
        {
            "number": "7",
            "text": "لِيُنْفِقْ ذُوْ سَعَةٍ مِّنْ سَعَتِهٖۗ وَمَنْ قُدِرَ عَلَيْهِ رِزْقُهٗ فَلْيُنْفِقْ مِمَّآ اٰتٰىهُ اللّٰهُ ۗ لَا يُكَلِّفُ اللّٰهُ نَفْسًا اِلَّا مَآ اٰتٰىهَاۗ سَيَجْعَلُ اللّٰهُ بَعْدَ عُسْرٍ يُّسْرًا ࣖ ",
            "teksLatin": "liyunfiq żū sa‘atim min sa‘atih(ī), wa man qudira ‘alaihi rizquhū falyunfiq mimmā ātāhullāh(u), lā yukallifullāhu nafsan illā mā ātāhā, sayaj‘alullāhu ba‘da ‘usriy yusrā(n).",
            "teksIndonesia": "Hendaklah orang yang mempunyai keluasan memberi nafkah menurut kemampuannya, dan orang yang terbatas rezekinya, hendaklah memberi nafkah dari harta yang diberikan Allah kepadanya. Allah tidak membebani kepada seseorang melainkan (sesuai) dengan apa yang diberikan Allah kepadanya. Allah kelak akan memberikan kelapangan setelah kesempitan. ",
            "tafsir": "Dalam ayat ini, Allah menjelaskan bahwa kewajiban ayah memberikan upah kepada perempuan yang menyusukan anaknya menurut kemampuannya. Jika kemampuan ayah itu hanya dapat memberi makan karena rezekinya sedikit, maka hanya itulah yang menjadi kewajibannya. Allah tidak akan memikulkan beban kepada seseorang melainkan sesuai dengan kemampuannya, sebagaimana firman-Nya:\n\nAllah tidak membebani seseorang melainkan sesuai dengan kesanggupannya. (al-Baqarah/2: 286)\n\nDalam ayat lain juga dijelaskan:\n\nSeseorang tidak dibebani lebih dari kesanggupannya. (al-Baqarah/2: 233)\n\nTidak ada yang kekal di dunia. Pada suatu waktu, Allah akan mem-berikan kelapangan sesudah kesempitan, kekayaan sesudah kemiskinan, kesenangan sesudah penderitaan. Allah berfirman:\n\nSesungguhnya beserta kesulitan itu ada kemudahan. (asy-Syarh/94: 6)",
            "tajweed": [
                {
                    "end": 7,
                    "rule": "ikhfa",
                    "start": 4
                },
                {
                    "end": 9,
                    "rule": "qalqalah",
                    "start": 7
                },
                {
                    "end": 24,
                    "rule": "idghaam_ghunnah",
                    "start": 19
                },
                {
                    "end": 28,
                    "rule": "ikhfa",
                    "start": 24
                },
                {
                    "end": 35,
                    "rule": "madd_2",
                    "start": 34
                },
                {
                    "end": 44,
                    "rule": "ikhfa",
                    "start": 40
                },
                {
                    "end": 67,
                    "rule": "madd_2",
                    "start": 66
                },
                {
                    "end": 77,
                    "rule": "ikhfa",
                    "start": 74
                },
                {
                    "end": 79,
                    "rule": "qalqalah",
                    "start": 77
                },
                {
                    "end": 85,
                    "rule": "ghunnah",
                    "start": 82
                },
                {
                    "end": 87,
                    "rule": "madd_munfasil",
                    "start": 85
                },
                {
                    "end": 95,
                    "rule": "madd_2",
                    "start": 94
                },
                {
                    "end": 99,
                    "rule": "hamzat_wasl",
                    "start": 98
                },
                {
                    "end": 121,
                    "rule": "hamzat_wasl",
                    "start": 120
                },
                {
                    "end": 147,
                    "rule": "madd_munfasil",
                    "start": 145
                },
                {
                    "end": 155,
                    "rule": "madd_2",
                    "start": 154
                },
                {
                    "end": 165,
                    "rule": "qalqalah",
                    "start": 163
                },
                {
                    "end": 171,
                    "rule": "hamzat_wasl",
                    "start": 170
                },
                {
                    "end": 194,
                    "rule": "idghaam_ghunnah",
                    "start": 190
                }
            ]
        },
        {
            "number": "8",
            "text": "وَكَاَيِّنْ مِّنْ قَرْيَةٍ عَتَتْ عَنْ اَمْرِ رَبِّهَا وَرُسُلِهٖ فَحَاسَبْنٰهَا حِسَابًا شَدِيْدًاۙ وَّعَذَّبْنٰهَا عَذَابًا نُّكْرًا ",
            "teksLatin": "wa ka'ayyim min qaryatin ‘atat ‘an amri rabbihā wa rusulihī fa ḥāsabnāhā ḥisāban syadīdā(n), wa ‘ażżabnāhā ‘ażāban nukrā(n).",
            "teksIndonesia": "Dan betapa banyak (penduduk) negeri yang mendurhakai perintah Tuhan mereka dan rasul-rasul-Nya, maka Kami buat perhitungan terhadap penduduk negeri itu dengan perhitungan yang ketat, dan Kami azab mereka dengan azab yang mengerikan (di akhirat),",
            "tafsir": "Dalam ayat ini, Allah menerangkan bahwa tidak sedikit daerah yang penduduknya menyalahi perintah-Nya, mendustakan rasul-rasul yang telah diutus kepada mereka. Mereka akan dihisab dengan perhitungan yang sangat teliti, sehingga terbongkar segala kejahatan yang telah diperbuatnya di dunia. Mereka lalu diazab dengan siksaan yang mengerikan.",
            "tajweed": [
                {
                    "end": 14,
                    "rule": "idghaam_ghunnah",
                    "start": 9
                },
                {
                    "end": 18,
                    "rule": "ikhfa",
                    "start": 14
                },
                {
                    "end": 64,
                    "rule": "madd_2",
                    "start": 63
                },
                {
                    "end": 74,
                    "rule": "qalqalah",
                    "start": 72
                },
                {
                    "end": 77,
                    "rule": "madd_2",
                    "start": 76
                },
                {
                    "end": 92,
                    "rule": "ikhfa",
                    "start": 87
                },
                {
                    "end": 101,
                    "rule": "idghaam_ghunnah",
                    "start": 96
                },
                {
                    "end": 108,
                    "rule": "qalqalah",
                    "start": 106
                },
                {
                    "end": 111,
                    "rule": "madd_2",
                    "start": 110
                },
                {
                    "end": 127,
                    "rule": "idghaam_ghunnah",
                    "start": 121
                }
            ]
        },
        {
            "number": "9",
            "text": "فَذَاقَتْ وَبَالَ اَمْرِهَا وَكَانَ عَاقِبَةُ اَمْرِهَا خُسْرًا ",
            "teksLatin": "fa żāqat wabāla amrihā wa kāna ‘āqibatu amrihā khusrā(n).",
            "teksIndonesia": "sehingga mereka merasakan akibat yang buruk dari perbuatannya, dan akibat perbuatan mereka, itu adalah kerugian yang besar. ",
            "tafsir": "Dalam ayat ini, Allah menerangkan bahwa orang-orang yang diazab di hari Kiamat dengan azab yang mengerikan adalah seperti orang-orang yang memetik hasil tanaman mereka, mendapatkan hasil usaha mereka sesuai dengan tanaman dan usaha mereka. Jika baik yang ditanam, baik pula yang akan dipetik, sebaliknya jika buruk yang ditanam, buruk pula yang akan dipetik, dan tidak mungkin terjadi sebaliknya. Sejalan dengan uraian ini, dalam ayat lain dijelaskan:\n\nBarang siapa mengerjakan kebajikan maka (pahalanya) untuk dirinya sendiri dan barang siapa berbuat jahat maka (dosanya) menjadi tanggungan dirinya sendiri. Dan Tuhanmu sama sekali tidak menzalimi hamba-hamba-(Nya). (Fussilat/41: 46)\n\nAkibat perbuatan buruk yang mereka kerjakan, mereka memperoleh kerugian yang sangat besar.",
            "tajweed": [
                {
                    "end": 39,
                    "rule": "madd_2",
                    "start": 38
                }
            ]
        },
        {
            "number": "10",
            "text": "اَعَدَّ اللّٰهُ لَهُمْ عَذَابًا شَدِيْدًا فَاتَّقُوا اللّٰهَ يٰٓاُولِى الْاَلْبَابِۛ الَّذِيْنَ اٰمَنُوْا ۛ قَدْ اَنْزَلَ اللّٰهُ اِلَيْكُمْ ذِكْرًاۙ ",
            "teksLatin": "a‘addallāhu lahum ‘ażāban syadīdan fattaqullāha yā ulil-albāb(i) - allażīna āmanū - qad anzalallāhu ilaikum żikrā(n).",
            "teksIndonesia": "Allah menyediakan azab yang keras bagi mereka, maka bertakwalah kepada Allah wahai orang-orang yang mempunyai akal! (Yaitu) orang-orang yang beriman. Sungguh, Allah telah menurunkan peringatan kepadamu, ",
            "tafsir": "Dalam ayat ini, Allah menerangkan bahwa bagi orang-orang yang senantiasa memperlihatkan keingkaran dan pembangkangan terhadap ajaran-ajaran para rasul yang berasal dari Allah, telah disediakan azab yang pedih di hari kemudian. Orang-orang yang berakal dan beriman mestinya bertakwa kepada Allah, karena Ia telah lama menurunkan peringatan yaitu Al-Qur'an, yang memperingatkan segala sesuatunya, untuk menjadi pegangan dengan mengamalkan serta mematuhi isinya.",
            "tajweed": [
                {
                    "end": 9,
                    "rule": "hamzat_wasl",
                    "start": 8
                },
                {
                    "end": 34,
                    "rule": "ikhfa",
                    "start": 29
                },
                {
                    "end": 43,
                    "rule": "ikhfa",
                    "start": 38
                },
                {
                    "end": 44,
                    "rule": "hamzat_wasl",
                    "start": 43
                },
                {
                    "end": 52,
                    "rule": "silent",
                    "start": 50
                },
                {
                    "end": 54,
                    "rule": "hamzat_wasl",
                    "start": 53
                },
                {
                    "end": 65,
                    "rule": "madd_munfasil",
                    "start": 63
                },
                {
                    "end": 69,
                    "rule": "silent",
                    "start": 67
                },
                {
                    "end": 74,
                    "rule": "hamzat_wasl",
                    "start": 73
                },
                {
                    "end": 83,
                    "rule": "madd_2",
                    "start": 82
                },
                {
                    "end": 87,
                    "rule": "hamzat_wasl",
                    "start": 86
                },
                {
                    "end": 106,
                    "rule": "silent",
                    "start": 104
                },
                {
                    "end": 111,
                    "rule": "qalqalah",
                    "start": 109
                },
                {
                    "end": 117,
                    "rule": "ikhfa",
                    "start": 114
                },
                {
                    "end": 121,
                    "rule": "hamzat_wasl",
                    "start": 120
                }
            ]
        },
        {
            "number": "11",
            "text": "رَّسُوْلًا يَّتْلُوْا عَلَيْكُمْ اٰيٰتِ اللّٰهِ مُبَيِّنٰتٍ لِّيُخْرِجَ الَّذِيْنَ اٰمَنُوْا وَعَمِلُوا الصّٰلِحٰتِ مِنَ الظُّلُمٰتِ اِلَى النُّوْرِۗ وَمَنْ يُّؤْمِنْۢ بِاللّٰهِ وَيَعْمَلْ صَالِحًا يُّدْخِلْهُ جَنّٰتٍ تَجْرِيْ مِنْ تَحْتِهَا الْاَنْهٰرُ خٰلِدِيْنَ فِيْهَآ اَبَدًاۗ قَدْ اَحْسَنَ اللّٰهُ لَهٗ رِزْقًا ",
            "teksLatin": "rasūlay yatlū ‘alaikum āyātillāhi mubayyinātil liyukhrijal-lażīna āmanū wa ‘amiluṣ-ṣāliḥāti minaẓ-ẓulumāti ilan-nūr(i), wa may yu'mim billāhi wa ya‘mal ṣāliḥay yudkhilhu jannātin tajrī min taḥtihal-anhāru khālidīna fīhā abadā(n), qad aḥsanallāhu lahū rizqā(n).",
            "teksIndonesia": "(dengan mengutus) seorang Rasul yang membacakan ayat-ayat Allah kepadamu yang menerangkan (bermacam-macam hukum), agar Dia mengeluarkan orang-orang yang beriman dan mengerjakan kebajikan, dari kegelapan kepada cahaya. Dan barangsiapa beriman kepada Allah dan mengerjakan kebajikan, niscaya Dia akan memasukkannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya. Sungguh, Allah memberikan rezeki yang baik kepadanya. ",
            "tafsir": "Dalam ayat ini, Allah menerangkan bahwa Dia telah mengutus seorang rasul untuk membacakan dan mengajarkan ayat-ayat kitab suci Al-Qur'an yang diturunkan kepadanya, yang mengandung bermacam-macam petunjuk dan hukum. Ayat-ayatnya sangat jelas dan mudah dipahami oleh orang yang mau memikirkan dan mempergunakan akalnya, agar orang-orang beriman dan mengerjakan amal saleh memperoleh petunjuk, dan keluar dari kegelapan menuju cahaya yang terang benderang. Orang-orang yang beriman kepada Allah mengakui kebesaran kekuasaan-Nya. Mereka itu akan dimasukkan ke dalam surga yang mengalir di bawahnya sungai-sungai, mereka kekal di dalamnya untuk selama-lamanya, tidak akan mati dan tidak akan dikeluarkan. Di dalam surga, mereka memperoleh beraneka macam kenikmatan yang besar, kelapangan rezeki berupa makanan dan minuman yang tidak pernah dilihat mata, didengar telinga, dan terlintas di dalam hati manusia.",
            "tajweed": [
                {
                    "end": 12,
                    "rule": "idghaam_ghunnah",
                    "start": 7
                },
                {
                    "end": 19,
                    "rule": "silent",
                    "start": 17
                },
                {
                    "end": 37,
                    "rule": "madd_2",
                    "start": 36
                },
                {
                    "end": 41,
                    "rule": "hamzat_wasl",
                    "start": 40
                },
                {
                    "end": 58,
                    "rule": "madd_2",
                    "start": 57
                },
                {
                    "end": 64,
                    "rule": "idghaam_no_ghunnah",
                    "start": 59
                },
                {
                    "end": 74,
                    "rule": "hamzat_wasl",
                    "start": 73
                },
                {
                    "end": 93,
                    "rule": "silent",
                    "start": 91
                },
                {
                    "end": 105,
                    "rule": "silent",
                    "start": 103
                },
                {
                    "end": 107,
                    "rule": "hamzat_wasl",
                    "start": 106
                },
                {
                    "end": 108,
                    "rule": "lam_shamsiyyah",
                    "start": 107
                },
                {
                    "end": 112,
                    "rule": "madd_2",
                    "start": 111
                },
                {
                    "end": 117,
                    "rule": "madd_2",
                    "start": 116
                },
                {
                    "end": 126,
                    "rule": "hamzat_wasl",
                    "start": 125
                },
                {
                    "end": 127,
                    "rule": "lam_shamsiyyah",
                    "start": 126
                },
                {
                    "end": 135,
                    "rule": "madd_2",
                    "start": 134
                },
                {
                    "end": 145,
                    "rule": "hamzat_wasl",
                    "start": 144
                },
                {
                    "end": 146,
                    "rule": "lam_shamsiyyah",
                    "start": 145
                },
                {
                    "end": 149,
                    "rule": "ghunnah",
                    "start": 146
                },
                {
                    "end": 161,
                    "rule": "idghaam_ghunnah",
                    "start": 157
                },
                {
                    "end": 169,
                    "rule": "iqlab",
                    "start": 166
                },
                {
                    "end": 171,
                    "rule": "hamzat_wasl",
                    "start": 170
                },
                {
                    "end": 192,
                    "rule": "madd_2",
                    "start": 191
                },
                {
                    "end": 200,
                    "rule": "idghaam_ghunnah",
                    "start": 195
                },
                {
                    "end": 202,
                    "rule": "qalqalah",
                    "start": 200
                },
                {
                    "end": 214,
                    "rule": "ghunnah",
                    "start": 211
                },
                {
                    "end": 215,
                    "rule": "madd_2",
                    "start": 214
                },
                {
                    "end": 220,
                    "rule": "ikhfa",
                    "start": 216
                },
                {
                    "end": 222,
                    "rule": "qalqalah",
                    "start": 220
                },
                {
                    "end": 232,
                    "rule": "ikhfa",
                    "start": 228
                },
                {
                    "end": 241,
                    "rule": "hamzat_wasl",
                    "start": 240
                },
                {
                    "end": 250,
                    "rule": "madd_2",
                    "start": 249
                },
                {
                    "end": 256,
                    "rule": "madd_2",
                    "start": 255
                },
                {
                    "end": 271,
                    "rule": "madd_munfasil",
                    "start": 269
                },
                {
                    "end": 282,
                    "rule": "ikhfa",
                    "start": 277
                },
                {
                    "end": 284,
                    "rule": "qalqalah",
                    "start": 282
                },
                {
                    "end": 295,
                    "rule": "hamzat_wasl",
                    "start": 294
                },
                {
                    "end": 307,
                    "rule": "madd_2",
                    "start": 306
                }
            ]
        },
        {
            "number": "12",
            "text": "اَللّٰهُ الَّذِيْ خَلَقَ سَبْعَ سَمٰوٰتٍ وَّمِنَ الْاَرْضِ مِثْلَهُنَّۗ يَتَنَزَّلُ الْاَمْرُ بَيْنَهُنَّ لِتَعْلَمُوْٓا اَنَّ اللّٰهَ عَلٰى كُلِّ شَيْءٍ قَدِيْرٌ ەۙ وَّاَنَّ اللّٰهَ قَدْ اَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا ࣖ",
            "teksLatin": "allāhul-lażī khalaqa sab‘a samāwātiw wa minal-arḍi miṡlahunn(a), yatanazzalul-amru bainahunna lita‘lamū annallāha ‘alā kulli syai'in qadīr(un), wa annallāha qad aḥāṭa bikulli syai'in ‘ilmā(n).",
            "teksIndonesia": "Allah yang menciptakan tujuh langit dan dari (penciptaan) bumi juga serupa. Perintah Allah berlaku padanya, agar kamu mengetahui bahwa Allah Mahakuasa atas segala sesuatu, dan ilmu Allah benar-benar meliputi segala sesuatu. ",
            "tafsir": "Dalam ayat ini, Allah menerangkan bahwa Dialah yang menciptakan tujuh petala langit dan yang menciptakan tujuh lapis bumi. Dalam sebuah hadis yang diriwayatkan oleh Ibnu Mas'ud , Nabi saw bersabda: \n\nWahai Abu dzarr, tidaklah ada (perbandingan) tujuh petala langit dengan kursi melainkan seperti lingkaran kecil di hamparan tanah yang luas. Sedangkan (perbandingan) 'Arsy dengan kursi di hamparan tanah yang luas dengan lingkaran kecil. (Riwayat Ibn hibban dan Abu Nu'aim)\n\nPerintah, qadha', dan qadar Allah berlaku di antara bumi dan langit. Dialah yang mengatur semuanya sesuai dengan ilmu-Nya yang Mahaluas, menerapkan kebijaksanaan-Nya yang adil dan membawa maslahat. Semuanya itu bertujuan agar manusia mengetahui sejauh mana kekuasaan Allah. Tidak ada sesuatu yang dapat menghalangi kehendak-Nya. Dia kuasa di atas segala sesuatu. Hal ini juga bertujuan agar manusia mengetahui bahwa ilmu Allah meliputi segala sesuatunya. Tidak ada sesuatu di langit dan di bumi walau bagaimanapun kecilnya, kecuali diketahui Allah. Tidak ada yang tersembunyi bagi-Nya, sebagaimana dijelaskan dalam firman-Nya:\n\nBagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan di langit. (Ali 'Imran/3: 5)\n\nDijelaskan juga dalam firman-Nya yang lain:\n\nDan tidak ada sesuatu pun yang tersembunyi bagi Allah, baik yang ada di bumi maupun yang ada di langit. (Ibrahim/14: 38)",
            "tajweed": [
                {
                    "end": 9,
                    "rule": "hamzat_wasl",
                    "start": 8
                },
                {
                    "end": 27,
                    "rule": "qalqalah",
                    "start": 25
                },
                {
                    "end": 35,
                    "rule": "madd_2",
                    "start": 34
                },
                {
                    "end": 38,
                    "rule": "madd_2",
                    "start": 37
                },
                {
                    "end": 43,
                    "rule": "idghaam_ghunnah",
                    "start": 39
                },
                {
                    "end": 49,
                    "rule": "hamzat_wasl",
                    "start": 48
                },
                {
                    "end": 69,
                    "rule": "ghunnah",
                    "start": 66
                },
                {
                    "end": 83,
                    "rule": "hamzat_wasl",
                    "start": 82
                },
                {
                    "end": 103,
                    "rule": "ghunnah",
                    "start": 100
                },
                {
                    "end": 116,
                    "rule": "madd_munfasil",
                    "start": 114
                },
                {
                    "end": 118,
                    "rule": "silent",
                    "start": 116
                },
                {
                    "end": 124,
                    "rule": "ghunnah",
                    "start": 121
                },
                {
                    "end": 126,
                    "rule": "hamzat_wasl",
                    "start": 125
                },
                {
                    "end": 155,
                    "rule": "ikhfa",
                    "start": 151
                },
                {
                    "end": 163,
                    "rule": "idghaam_ghunnah",
                    "start": 159
                },
                {
                    "end": 168,
                    "rule": "ghunnah",
                    "start": 165
                },
                {
                    "end": 170,
                    "rule": "hamzat_wasl",
                    "start": 169
                },
                {
                    "end": 181,
                    "rule": "qalqalah",
                    "start": 179
                }
            ]
        }
    ]
}